package main

func main() {
	/*
	1.[]中没有数字就是切片, []中有数字就是数组
	 */

	 // 1.数组
	 //var ages [3]int = [3]int{1, 3, 5} // 这里是数组
	 //var ages = [3]int{1, 3, 5} // 这里是数组
	 //ages := [3]int{1, 3, 5} // 这里是数组
	//ages  := [...]int{1, 3, 5} // 这里写...代表是定义一个数组

	// 2.切片
	//var ages []int = []int{1, 3, 5} // 省略元素个数, 这里不是数组是切片
	//var ages = []int{1, 3, 5} // 省略元素个数, 这里不是数组是切片
	//ages := []int{1, 3, 5} // 省略元素个数, 这里不是数组是切片
	//fmt.Println(ages)


	// 3.二维数组
	// 定义一个数组, 数组中存储的又是数组
	//var values [2][3]int = [2][3]int{
	//	{1, 3, 5},
	//	{2, 4, 5},
	//}
	//var values = [2][3]int{
	//	{1, 3, 5},
	//	{2, 4, 5},
	//}
	//values := [2][3]int{
	//	{1, 3, 5},
	//	{2, 4, 5},
	//}
	//values := [...][3]int{
	//	{1, 3, 5},
	//	{2, 4, 5},
	//}

	// 2.切片
	// 定义一个切片, 切片中保存的是数组
	//var values [][3]int = [][3]int{
	//	{1, 3, 5},
	//	{2, 4, 5},
	//}
	//var values = [][3]int{
	//	{1, 3, 5},
	//	{2, 4, 5},
	//}
	//values := [][3]int{
	//	{1, 3, 5},
	//	{2, 4, 5},
	//}

	//  定义一个切片, 切片中保存的是切片
	//var values [][]int = [][]int{
	//	{1, 3, 5},
	//	{2, 4, 5},
	//}
	//var values = [][]int{
	//	{1, 3, 5},
	//	{2, 4, 5},
	//}
	//values := [][]int{
	//	{1, 3, 5},
	//	{2, 4, 5},
	//}
	//fmt.Println(values)
}
